class ListDataModel {
  String title;
  String subtitle;
  String details;
  ListDataModel(
    this.title,
    this.subtitle,
    this.details,
  );
}

List<String> titleData = [
  "গর্ভধারণের প্রথম তিন সপ্তাহ",
  "গর্ভধারণের চতুর্থ সপ্তাহ",
  "গর্ভধারণের পঞ্চম সপ্তাহ",
  "গর্ভধারণের ষষ্ঠ সপ্তাহ",
];

List<String> subData = [
  "আপনার গর্ভের বাচ্চার বয়স কত সে অনুযায়ী বিভিন্ন পদক্ষেপ নিতে হয়।  ",
  "সাধারণত গর্ভধারণের সময়কাল হল আপনার সর্বশেষ মাসিক/মেন্স বা পিরিয়ডের দুই সপ্তাহ পরে, অর্থাৎ আপনার ডিম্বপাতের কাছাকাছি সময়ে।",
  "এটি হল প্রথমবারের মত বন্ধ হওয়া পিরিয়ড বা মাসিকের সময়। অধিকাংশ নারী এসময়ই মাত্র বুঝতে শুরু করেন যে তিনি সম্ভবত গর্ভবতী। ",
  "৬ষ্ঠ সপ্তাহে বাইরে থেকে দেখে আপনি গর্ভবতী কিনা তা বুঝা না গেলেও, আপনার গর্ভে এসময় শিশুটি খুব দ্রুত বেড়ে উঠতে থাকে।",
];

List<String> detail = [
  """ আপনার গর্ভের বাচ্চার বয়স কত সে অনুযায়ী বিভিন্ন পদক্ষেপ নিতে হয়। তাই শুরুতেই আলোচনা করছি কীভাবে এই হিসাব করতে হয়।

আপনার সর্বশেষ মাসিকের প্রথম দিন থেকে আপনার গর্ভকাল অর্থাৎ আপনি কতদিন ধরে গর্ভধারণ করেছেন তা হিসাব করা হবে। ধরুন, গত মাসের ৫ তারিখ আপনার মাসিক শুরু হয়ে ১০ তারিখে শেষ হয়েছে। এরপর আপনার আর মাসিক হয়নি। তাহলে গত মাসের ৫ তারিখ থেকে আপনার গর্ভকাল হিসাব করা হবে।

প্রথম থেকে তৃতীয় সপ্তাহে আপনার করনীয়

সবার আগে নারীরা যে বিষয়টি খেয়াল করেন তা হল তাদের মাসিক বা পিরিয়ড বন্ধ হয়ে যাওয়া। 

আপনি গর্ভবতী কিনা তা জানার সবচেয়ে নির্ভরযোগ্য উপায় হল প্রেগন্যান্সি টেস্ট করা। ঘরে বসেই স্ট্রিপের মাধ্যমে প্রস্রাব পরীক্ষা করে জেনে নিতে পারেন আপনি গর্ভবতী কিনা। প্রায় সব ফার্মেসিতেই এই স্ট্রিপ কিনতে পাওয়া যায়। আপনার নিকটস্থ ক্লিনিক বা স্বাস্থ্যকেন্দ্রে রক্ত পরীক্ষা করেও নিশ্চিত হতে পারেন।

এসময় কিছু কিছু শারীরিক পরিবর্তন বা লক্ষণ দেখা দিতে পারে। যেমন:

স্তনে, বিশেষ করে স্তনের বোঁটায় খোঁচাখোঁচা ভাব বা অস্বস্তি হতে পারে। গর্ভাবস্থায় স্তনে রক্ত সরবরাহ বেড়ে যাওয়ার কারণে এমনটা হয়ে থাকে। 
যোনিতে অর্থাৎ মাসিকের রাস্তায় রক্ত সরবরাহ বেড়ে যাওয়ার কারণে যোনিদ্বার তথা মাসিকের রাস্তার মুখের অংশটি গাঢ় বা কালচে হয়ে যেতে পারে; সাধারণত এটি ফ্যাকাশে গোলাপি রঙের হয়ে থাকে। 
সাদাস্রাবের পরিমাণ স্বাভাবিকের চেয়ে বেশি হতে পারে, এতে দুশ্চিন্তার কিছু নেই। 
গর্ভধারণের ২-৩ সপ্তাহে যোনিপথ তথা মাসিকের রাস্তা থেকে হালকা বা কয়েক ফোঁটা রক্তপাত হতে পারে। 
এসময় ক্ষুধা বা খাদ্যাভাসে লক্ষণীয় কিছু পরিবর্তন আসতে পারে, যেমন হঠাৎ হঠাৎ কোন খাবার খাওয়ার তীব্র ইচ্ছা অথবা প্রিয় কোন খাবারের প্রতি হঠাৎ অনীহা। সাধারণত গর্ভবতী মায়েদের ক্ষেত্রে টকজাতীয় খাবারের প্রতি বাড়তি আগ্রহ অথবা ডিম, ভাজাপোড়া বা ক্যাফেইন-জাতীয় পানীয়ের (চা, কফি, ইত্যাদি) প্রতি অরুচি দেখা যায়।
এসময় খুব ক্লান্ত বা অবসন্ন বোধ হতে পারে। আপনার গর্ভের শিশুর বৃদ্ধির জন্য শরীরে যে অতিরিক্ত শক্তি খরচ হচ্ছে তার জন্য এমনটা বোধ হয়। তাই এসময় পর্যাপ্ত বিশ্রাম নেয়া উচিত। 
আপনি গর্ভধারণ করেছেন এ বিষয়ে নিশ্চিত হওয়ার পর আপনার গর্ভকালীন পরিচর্যা শুরু করার জন্য যত তাড়াতাড়ি সম্ভব ডাক্তার বা আপনার নিকটস্থ স্বাস্থ্যকেন্দ্রের স্বাস্থ্যকর্মীর সাথে যোগাযোগ করুন।


""",
  """সাধারণত গর্ভধারণের সময়কাল হল আপনার সর্বশেষ মাসিক/মেন্স বা পিরিয়ডের দুই সপ্তাহ পরে, অর্থাৎ আপনার ডিম্বপাতের কাছাকাছি সময়ে। (গর্ভধারণে সক্ষম নারীদের ডিম্বাশয় থেকে প্রতিমাসে ডিম্বাণু বের হয়, একে ডিম্বপাত বলা হয়ে থাকে।)

গর্ভাবস্থার প্রথম ৪ সপ্তাহে আপনি হয়তো কোন লক্ষণই খেয়াল করবেন না।

নারীরা গর্ভধারণ করলে সবার আগে যেই বিষয়টি বুঝতে পারেন তা হল তাদের মাসিক বা পিরিয়ড বন্ধ হয়ে যাওয়া। এছাড়া গর্ভাবস্থার অন্যান্য লক্ষণ, যেমন চাপ দিলে স্তনে ব্যথা অনুভব করা (breast tenderness), এমন লক্ষণও থাকতে পারে। কারো কারো ক্ষেত্রে মাসিকের তারিখে যোনিপথ তথা মাসিকের রাস্তা থেকে হালকা বা ফোঁটা ফোঁটা রক্তপাতও হতে পারে – মাসিক নিয়ন্ত্রণকারী হরমোনগুলোর প্রভাবে এমনটা হয়ে থাকে। এতে সাধারণত ঘাবড়ানোর কোন কারণ নেই। গর্ভাবস্থায় এক বা একাধিকবার এমনটা হতে পারে৷

তবে যদি রক্তপাতের পরিমাণ বেশি হয় সেক্ষেত্রে অবশ্যই দেরি না করে ডাক্তারের শরণাপন্ন হতে হবে৷ 

অধিকাংশ নারীই প্রেগন্যান্সি টেস্টের মাধ্যমে গর্ভধারণ সম্পর্কে নিশ্চিত হোন।

আপনার সর্বশেষ অর্থাৎ গত মাসিকের প্রথম/শুরুর দিন থেকে হিসাব করে আপনি আপনার সন্তান জন্মদানের সময় অর্থাৎ ডেলিভারির সম্ভাব্য তারিখ বের করতে পারেন, আবার আল্ট্রাসাউন্ড স্ক্যান করেও এটি জানা যায়। তবে এই দুই পদ্ধতিতে বের করা সময়সীমায় কিছুটা পার্থক্য থাকতে পারে। """,
  """এটি হল প্রথমবারের মত বন্ধ হওয়া পিরিয়ড বা মাসিকের সময়। অধিকাংশ নারী এসময়ই মাত্র বুঝতে শুরু করেন যে তিনি সম্ভবত গর্ভবতী। 

তবে অনেকের ক্ষেত্রে পিরিয়ড প্রতি মাসে নির্দিষ্ট সময়ে না হয়ে কিছুটা আগে বা পরে হয়। তাই তারা গর্ভধারণের ব্যাপারটি আরো দেরিতে বুঝতে পারেন। এছাড়া গর্ভের ভ্রূণটি গর্ভাশয়ের দেয়ালে বসতে গিয়ে মাসিকের রাস্তা দিয়ে কিছুটা রক্তপাতও হতে পারে (ইমপ্লান্টেশন ব্লিডিং); অনেকেই একে পিরিয়ডের বা মাসিকের রক্ত মনে করে ভুল বুঝতে পারেন। 

তবে এসময় পিরিয়ড বন্ধ থাকা ছাড়াও গর্ভবতী মায়ের শরীরে কিছু লক্ষণ দেখা দেয়, যা থেকে গর্ভধারণের বিষয়টি প্রাথমিকভাবে অনুমান করা যেতে পারে।  """,
  """ ৬ষ্ঠ সপ্তাহে বাইরে থেকে দেখে আপনি গর্ভবতী কিনা তা বুঝা না গেলেও, আপনার গর্ভে এসময় শিশুটি খুব দ্রুত বেড়ে উঠতে থাকে। আর তার বৃদ্ধির জন্য প্রয়োজনীয় সমস্ত উপকরণ সে আপনার শরীর থেকে গ্রহণ করে। তাই স্বাভাবিকভাবেই এসময় আপনি অত্যন্ত ক্লান্ত অনুভব করে থাকেন। 

গর্ভাবস্থার প্রথমদিকের লক্ষণগুলো এসপ্তাহেও প্রায় একই থাকে: 

স্বাভাবিকের চেয়ে বেশি ক্লান্তি অনুভব করা, 
স্তনে হালকা ব্যথা হওয়া বা চাপ দিলে ব্যথা অনুভব করা, 
মুখে ধাতব এক ধরনের স্বাদ (মেটালিক টেস্ট) পাওয়া বা খবারের স্বাদ বুঝতে না পারা, 
বমি বমি ভাব হওয়া (মর্নিং সিকনেস), 
মাথাব্যথা, 
মুড সুইং বা ঘন ঘন মেজাজ পরিবর্তন হওয়া,
খাদ্যাভ্যাসে লক্ষণীয় পরিবর্তন আসা। হঠাৎ নতুন কোন খাবারে তীব্র রুচি বা প্রিয় কোন খাবারে অরুচি দেখা দেওয়া,
ঘ্রাণ শক্তি আগের চেয়ে তীব্র হওয়া,
ছোটখাটো বিষয়ে মন খারাপ লাগা/কান্না করে ফেলার প্রবণতা দেখা দেওয়া। গর্ভাবস্থায় শরীরের হরমোনগুলোর ওঠানামার কারণে এসব লক্ষণ দেখা দেয়,
সাদস্রাবের পরিমাণ বেড়ে যাওয়া,
পিরিয়ডের ব্যথার মত তলপেটে মোচড়ানো বা ব্যথা হওয়া,
পেটে অস্বস্তি বা পেট ফাঁপা হয়েছে এমন মনে হওয়া। 
মনে রাখতে হবে গর্ভাবস্থায় আবেগপ্রবণ অনুভব করা খুবই স্বাভাবিক। একেক জনের ক্ষেত্রে এই অভিজ্ঞতাও একেকরকম হযয়ে থাকে। তাই এ নিয়ে বিচলিত হওয়ার কোন কারণ নেই।""",
];

final List<ListDataModel> listData = List.generate(
  titleData.length,
  (index) => ListDataModel(
      "${titleData[index]}", "${subData[index]}", "${detail[index]}"),
);
